{"id":1044,"date":"2016-10-10T09:24:10","date_gmt":"2016-10-10T09:24:10","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=1044"},"modified":"2016-10-10T09:24:10","modified_gmt":"2016-10-10T09:24:10","slug":"how-to-keep-your-face-clean-and-healthy","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/how-to-keep-your-face-clean-and-healthy\/","title":{"rendered":"How to Keep Your Face Clean and Healthy"},"content":{"rendered":"When you think of impressive personalities, what is the first thing that comes to your mind? Is it the shoes that they were wearing when you met them? Or the way they were dressed? The first thing that comes to your mind is their face, partially because the human mind is trained to remember people by their faces and partially because the most impressive people around have the most impressive faces.\n\nYour face looks best when it is clean and healthy. Here are ten simple tips that will ensure that your face looks clean and healthy, always.\n\n<strong>1. It has to be a daily thing<\/strong>\n\nThe first thing that you need to realise is that caring for your face has to be a daily thing and not just a once in a while affair. If you do not care for your face every day, you will end up spending thousands on skincare and yet will not get the results that you want.\n\n<strong>2. You must know your skin type<\/strong>\n\nEach person has a unique skin type; in fact, everybody’s skin is as different as they are themselves. In order to get started in the right direction, you need to know what your skin type is.\n\n<strong>3. Wash twice a day<\/strong>\n\nYou must get in the habit of washing your face twice in a day with a quality face wash, use one that moisturises your skin during the winters and one that exfoliates during the summer season.\n\n<strong>4. Use a clean towel<\/strong>\n\nTowels, if they are used once are a potential hub for bacteria and other infection causing agents. This goes double for moist or wet towels. Never reuse towels, especially for your face; the skin on your face is more prone to infections than skin anywhere else. Make sure you always use only clean, dry and if possible, disinfected towel for your face.\n\n<strong>5. Use a quality toner<\/strong>\n\nToners are great when you have oily skin and clogged pores. Buy a quality toner and use it on the part of your face that has the most oil build-up (forehead, nose and cheeks a.k.a the “T” zone). The toner that you use can have special ingredients as well, certain toners contain exfoliating agents and others contain anti-inflammatory agents for sensitive skin types.\n\n<strong>6. Treat gentle skin gently<\/strong>\n\nThe skin under your eyes is very sensitive, make sure you treat it that way, massage the area gently for might damage the microvasculature if you do it wrong, this will lead to saggy eyes or dark circles.\n\n<strong>7. Try not to touch your face<\/strong>\n\nWhen you touch your face more often than you should, you risk transmitting infection that you have on your hands, your face. If you have to touch your face (like when to apply makeup or to wash it) ensure that your hands are clean first.\n\n<strong>8. Try makeup before you use it<\/strong>\n\nWhenever you go makeup shopping you must try the makeup on a patch of your skin (preferably on your hands). This is because not all makeup suits all skin types and you must find the one that suits yours.\n\n<strong>9. Stay hydrated<\/strong>\n\nStaying hydrated has a lot to do with your skin’s health. When you stay hydrated, you are getting rid of the toxins that can potentially damage your skin. Also, you improve circulation to your skin which helps you get a healthy skin.\n\n<strong>10. Eat right<\/strong>\n\nEating foods that are rich in vitamins, minerals and other vital nutrients is another way that you can ensure that your skin gets everything that it needs. Remember, eat your fruit and juice your vegetables.\n\n<strong>11. Get a facial<\/strong>\n\nGet a facial (preferably a medi-facial) often. When you do that, you accelerate your skin turnover rate. And that helps you get great, healthy and glowing skin.\n\nMedi-facials are a great new way to get a facial that guarantees immediate results.\n\nVisit <a href=\"https:\/\/garekarsmdskinclinic.com\/facials\/\">https:\/\/garekarsmdskinclinic.com\/facials\/<\/a> for more details.\n\n<strong>12. Exfoliate weekly<\/strong>\n\nWhen you exfoliate every week, you are getting rid of all the dirt and grime that your face has built up over time. Doing this is a great way to have healthy, radiant skin.\n\n<strong>13. Get expert opinion<\/strong>\n\nWhen your skin problems seem to wear you down and are more persistent than you are. It’s time to seek professional help.\n\nGet the right consultation, diagnosis and treatments only at <a href=\"https:\/\/garekarsmdskinclinic.com\/\">the best skin specialist in DLF Phase 1, Gurgaon<\/a>.\n\nWe are the Garekars and we offer all Clinical, Cosmetic and Aesthetic treatments that suit all you needs and budgets.","protected":false},"excerpt":{"rendered":"<p>When you think of impressive personalities, what is the first thing that comes to your mind? Is it the shoes that they were wearing when you met them? Or the way they were dressed? The first thing that comes to your mind is their face, partially because the human mind is trained to remember people [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1045,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1044"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=1044"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1044\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/1045"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=1044"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=1044"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=1044"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}