{"id":1071,"date":"2016-10-12T05:25:26","date_gmt":"2016-10-12T05:25:26","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=1071"},"modified":"2016-10-12T05:25:26","modified_gmt":"2016-10-12T05:25:26","slug":"how-to-treat-acne-fast","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/how-to-treat-acne-fast\/","title":{"rendered":"How to Treat Acne Fast"},"content":{"rendered":"Acne is probably the most common skin condition that you can have. Every single person in the world gets acne at one point in their lives. When you get pimples and you have an important event that same week, the first thought that comes to your mind is –“How do I get rid of this ugly thing fast?!”\n\nIf you have been in this situation and have known the hopelessness that surrounds your entire being at the thought of having an angry red pimple sitting on your face in all the photos that you were supposed to look fabulous in.\n\nBut fret not, Garekars M.D Skin Clinic, the best dermatology clinic in Gurgaon has compiled a list of ten things that you can do at home to get rid of that pimple fast.\n\n<strong>1. Ice<\/strong>\n\nIce helps with the irritation and the redness around the pimple, thus reducing its appearance. It is easy to find it around the house as well.\n\nHere’s how you should go about it.\n\nWrap the ice cube in a piece of cloth; hold it on the affected area for a few seconds. Wait for some time and repeat the process.\n\n<strong>2. Lemon<\/strong>\n\nAnother quick way that you can get rid of your pimple problem fast is by using lemon juice to dry up the pimple. The only thing that you need to be sure of is the fact that the juice that you use is fresh and not out of a bottle, because bottled lemon juice has preservatives.\n\nDip a clean cotton swab in fresh lime juice and apply it to the pimples before going to bed.\n\n<strong>3. Toothpaste<\/strong>\n\nYou need to avoid using gel based toothpastes for this. After taking the ice therapy apply toothpaste on the affected area and let it dry. Leave it on for a couple of hours and wash off with water; you will notice a remarkable difference in the swelling and redness.\n\n<strong>4. Tea Tree oil<\/strong>\n\nThis is a natural antiseptic that is sure to help you get rid of most of the infection that your pimple prone areas of your face might have. Dip a clean cotton ball in tea tree oil and dab it on your face for 5 minutes. Leave to dry and rinse off. Follow this step as many times as you need each day.\n\n<strong>5. Steam<\/strong>\n\nOne of the real time tested ways to get rid of pimples. Steaming helps get rid of oils, dirt and bacteria that clog your skin.\n\nAll you have to do is to fill a large container with hot water and allow the steam to come in contact with your face for a few minutes. Rinse your face with lukewarm water pat dry with a clean towel.\n\n<strong>6. Baking Soda<\/strong>\n\nBaking Soda helps exfoliate the skin and helps remove excess oil, dirt and dead skin cells.\n\nHow to go about it?\n\nMake a thick paste by mixing 1 tbsp. of baking soda with some water or lemon juice. Put it on the affected areas and let dry (warning: do not leave for more than 5 minutes). Wash face with warm water. Repeat twice in a day.\n\n<strong>7. Garlic<\/strong>\n\nGarlic is an antiviral, anti fungal, antiseptic and antioxidant. The best thing about the home remedy is that it is really fast in getting you the results that you need. Crush one clove to release the juice and let a small ball of cotton absorb it. Put the ball on the affected area and wait for 5 minutes before you wash it off.\n\n<strong>8. Honey<\/strong>\n\nHoney is also a natural antibiotic that helps accelerate the healing process. And helps prevents infections. Wash skin first and put a small amount of honey on the affected area and let sit for half an hour before washing again.\n\n<strong>9. Papaya<\/strong>\n\nPapaya is a rich source of the antioxidant Vitamin A, the enzyme helps reduce inflammation and makes your skin soft. Mash a raw papaya and place it over the pimple prone area and leave for 10 minutes before washing.\n\n<strong>10. Cucumber<\/strong>\n\nCucumber is a rich source of potassium and Vitamins such as A, C and E. It also has a cooling effect on your skin.\n\nCut slices of cucumber and leave them in water, once the chlorophyll has transferred to the water and it has a slightly greenish tinge, you have to drink the water, or you can wash your face with it.\n\nIf however, your acne is persistent and won’t leave you alone, seek professional help at the best dermatologist in DLF Phase 1, Gurgaon.","protected":false},"excerpt":{"rendered":"<p>Acne is probably the most common skin condition that you can have. Every single person in the world gets acne at one point in their lives. When you get pimples and you have an important event that same week, the first thought that comes to your mind is –“How do I get rid of this [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1072,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1071"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=1071"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1071\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/1072"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=1071"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=1071"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=1071"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}