{"id":1120,"date":"2016-10-26T06:10:22","date_gmt":"2016-10-26T06:10:22","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=1120"},"modified":"2016-10-26T06:10:22","modified_gmt":"2016-10-26T06:10:22","slug":"common-skin-conditions-can","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/common-skin-conditions-can\/","title":{"rendered":"Some Common Skin Conditions (and what you can do about them)"},"content":{"rendered":"Garekars M.D. Skin Clinic takes pride in being able to diagnose and prevent skin diseases on or before time and we have the best clinical dermatology services in DLF Phase 1, Gurgaon.\n\nWith years of experience to back this claim we bring to you, insight about some common skin conditions that might or might not affect you.\n\nHere are some of the most common skin conditions that affect you and what you can do about them at home.\n\n<strong>1. Measles<\/strong>\n\nMeasles is a highly contagious skin infection and is caused by a virus. Children and youngsters are the most commonly affected age group and symptoms usually include high grade fever and rashes on skin.\n\nAt home, make sure that you rest a lot, drink plenty of water, juices and electrolytes and sleep enough. Like all viruses, once the measles virus completes its life cycle, the symptoms will subside.\n\n<strong>2. Acne<\/strong>\n\nAcne is the most common skin problem that everybody suffers from at some point of their life or the other. Acne is caused by clogging of the skin pores with either dirt or dead skin cells. Teenagers are the high risk group for the condition.\n\nTo learn more about the various in home treatment options for acne, click here <a href=\"https:\/\/garekarsmdskinclinic.com\/how-to-treat-acne-fast\/\">https:\/\/garekarsmdskinclinic.com\/how-to-treat-acne-fast\/<\/a>\n\n<strong>3. Hemangioma<\/strong>\n\nHemangiomas are benign (non-cancerous) growths that are formed due to an abnormal aggregation of blood vessels. Most common amongst pre term infants, the condition is what most people consider to be birth marks.\n\nThe condition is self-rectifying and treatment can be accelerated by application of dry ice to the lesion.\n\n<strong>4. Cold Sores<\/strong>\n\nCaused by Herpes Simplex Virus (HSV), the lesion is highly infectious; the most common site for occurrence of the lesion is the lips. The lesion can’t be cured, only managed. As is true with all the conditions on the list, the best kind of medicine for this particular lesion is prevention. At home, application of ice, zinc oxide and Aloe Vera might help alleviate the symptoms.\n\n<strong>5. Psoriasis<\/strong>\n\nPsoriasis is a long lasting auto-immune condition that requires a medical diagnosis, the condition that is characterized by itchy, red and scaly skin. At home, you can avoid alcoholic drinks, use a humidifier and reduce your stress levels to deal with the condition.\n\n<strong>6. Rosacea<\/strong>\n\nThe condition leads to irritated skin that turns red and often is accompanied with small pus filled bumps on the face which can spread as far as the neck. The disease is long standing and needs medical attention.\n\nAt home, you can apply honey on the lesion and can also try an oatmeal bath to get rid of the symptoms.\n\n<strong>7. Eczema<\/strong>\n\nIs also known as dermatitis, and this is not a disease in itself but a group of diseases with variable causes that lead to this particular symptom. This makes it imperative for you to visit your dermatologist and get the correct diagnosis and line of treatment for the condition.\n\nAt home, you can mix some vegetable oil\/ olive oil with mil into your bath water, this helps with the dry skin.\n\n<strong>8. Hives<\/strong>\n\nHives is a skin rash that follows a trigger, could be food, medicine, dust or other irritants. The condition is self-diagnosable and can’t be completely cured. But the good news is that it follows a short term course.\n\nA cold compress is all that you need to get rid of the condition effectively.\n\n<strong>9. Vitiligo<\/strong>\n\nIs a skin condition that causes the loss of skin pigment in circumscribed areas of skin, the result is that certain areas of your skin get a pale appearance that has a sharp contrast to the your actual skin tone.\n\nAt home, papaya is your best friend, cut papaya into small pieces and apply it on the affected areas, you may also have papaya juice to relieve melanin cells.\n\n<strong>10. Warts<\/strong>\n\nA wart is a raised bump on your skin that is caused by the Human Papilloma Virus (HPV). All types of HPV cause warts and these warts most commonly occur on your hands and feet. Your <a href=\"https:\/\/garekarsmdskinclinic.com\/wart-removal-gurgaon\/\">dermatologist can remove these warts<\/a> for you.\n\nAt home, cut a piece of garlic and apply on the wart for 20 minutes, and then wash the area off, do this for a week and the wart will blister and fall off.\n\n<strong>11. Fungal infections<\/strong>\n\nFungal skin infections are very common amongst athletes. The best way to get the right medication for a fungal infection is by getting a culture test done at your dermatologists’.\n\nWhen you have skin problems and you want to find the right, permanent solutions, we suggest you find your way to <a href=\"https:\/\/garekarsmdskinclinic.com\/\">Garekars M.D. Skin clinic<\/a>, the best skin clinic in DLF, Phase 1.","protected":false},"excerpt":{"rendered":"<p>Garekars M.D. Skin Clinic takes pride in being able to diagnose and prevent skin diseases on or before time and we have the best clinical dermatology services in DLF Phase 1, Gurgaon. With years of experience to back this claim we bring to you, insight about some common skin conditions that might or might not [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1124,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1120"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=1120"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1120\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/1124"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=1120"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=1120"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=1120"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}