{"id":1127,"date":"2016-10-31T05:46:30","date_gmt":"2016-10-31T05:46:30","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=1127"},"modified":"2016-10-31T05:46:30","modified_gmt":"2016-10-31T05:46:30","slug":"what-is-retin-a-tretinoin-and-how-to-use-it-right","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/what-is-retin-a-tretinoin-and-how-to-use-it-right\/","title":{"rendered":"What is Retin- A- Tretinoin and How to Use it Right?"},"content":{"rendered":"Tretinoin is a pharmaceutical form of Retinoic acid, which is a metabolite of Vitamin A. It is a carboxylic acid form of Vitamin A and is also known as ATRA (all-trans retinoic acid).\n\nThe medication is used to treat a wide variety of skin conditions also to promote quick healing of skin lesions so as to prevent recurrence.\n\nThe skin conditions that Retin- a- Tretinoin is used for are-\n\n<strong>1. Acne<\/strong>\n\nAcne is a common skin condition that can be treated with retin- a- tretinoin. And the results that the drug has are amazing, not only in treating acne but also in preventing recurrence of acne.\n\n<strong>2. Pimples<\/strong>\n\nPimples stand no chance against tretinoin, the drug is very effective in treating pimples and has been known to stop recurrence.\n\n<strong>3. Wrinkles<\/strong>\n\nTretinoin will affect the growth of skin cells and collagen and will thus change the way that wrinkle formation and aging take place. Tretinoin creams come in various strengths (0.025%, 0.05%, and 0.1%) and they can be used preventively as well.\n\nWhat doses do you use? The usual practice is to use as much of a concentration as your body will allow without having side effects.\n\nOther diseases where the drug has its uses-\n\n<strong>1. Leukemia (Acute Promyelocytic Leukemia)<\/strong>\n\nTretinoin is used in the oral form in the treatment of leukemia in patients where regular drug therapy has failed, the drug is not used as a maintenance drug and should be avoided in pregnant women.\n\nAt a molecular level, the drug stops APL cells from multiplying and thus prevents cancer from becoming more severe.\n\nHere are some known side effects of the drug. Side effects for topical use include-\n\n<strong>1. Irritation- <\/strong>Prolonged use of tretinoin can lead to skin irritation that is exacerbated by dryness.\n\n<strong>2. Redness- <\/strong>Redness is another symptom that accompanies irritation of the skin.\n\n<strong>3. Swelling- <\/strong>When you use a concentration of the drug that is higher than your tolerance for the drug, swelling can occur.\n\n<strong>4. Blistering- <\/strong>This is rare but in some cases, tretinoin might cause small blister formation that will heal with the withdrawal of medication.\n\n<strong>5. Sunburn- <\/strong>Tretinoin will also leave skin more prone to sun damage because of the very effect that makes it great for your skin. New skin cells and collagen are more susceptible to skin damage and thus need to be protected from it.\n\nSide effects of orally ingested form are-\n\n1. Malaise\n2. Shivering\n3. Haemorrhage\n4. Infections\n5. Peripheral oedema\n6. Pain\n7. Chest discomfort\n\nAnd many others, the list shows that the drug is safer to be used topically and should only be prescribed orally when expressly indicated.\n\nSome precautions that you must take when you use retin-a-tretinoin are-\n\n<strong>1. Never take the drug when pregnant <\/strong>\n\nThe drug is absorbed via the skin into the bloodstream and therefore, should not be consumed by pregnant and lactating women.\n\n<strong>2. Never use the drug on dry skin<\/strong>\n\nThe drug has a skin drying effect. Tretinoin can cause further dryness of the skin which can cause the skin to break.\n\n<strong>3. Never apply the drug on eczema<\/strong>\n\nEczema is a condition which leads to dry skin, applying tretinoin on the lesion will just make it worse and lead to ruptured and broken skin.\n\n<strong>4. Avoid prolonged exposure to the sun<\/strong>\n\nTretinoin will leave skin exposed to sun damage because of all the new skin cells (including collagen) that it helps create.\n\n<strong>5. Never apply on sunburnt skin<\/strong>\n\nNever apply the medication on sunburnt skin. Wait until the burn is fully healed.\n\n<strong>6. Use a sunscreen daily<\/strong>\n\nTretinoin is a night cream, but the effects carry on the whole day long. You need to make sure that you use a sunscreen daily during the morning and the noon hours.\n\n<strong>7. Don’t drink alcohol<\/strong>\n\nDon’t drink alcohol. Alcohol is a diuretic which will dehydrate your skin. Never drink alcohol when you are using tretinoin.\n\n<strong>8. Don’t use aspirin with the drug<\/strong>\n\nSalicylic acid and tretinoin will react and have adverse drug reactions. Avoid mixing the combination.\n\n<strong>9. Wash your hand before each application<\/strong>\n\nThis is true not just for this particular drug but for all emollients, cream, and gel-based topical applications. You should wash your hands before each application to prevent cross contamination.\n\nRetin a tretinoin is a drug that works great on wrinkles, recurrent acne, and pimples and has been shown to have great results. But the use of the drug should be monitored and supervised by an experienced dermatologist.\n\nFind your way to <a href=\"https:\/\/garekarsmdskinclinic.com\/\">the best clinical dermatologist in DLF Phase 1<\/a>, Gurgaon and get the best diagnosis and management for all your skin problems.","protected":false},"excerpt":{"rendered":"<p>Tretinoin is a pharmaceutical form of Retinoic acid, which is a metabolite of Vitamin A. It is a carboxylic acid form of Vitamin A and is also known as ATRA (all-trans retinoic acid). The medication is used to treat a wide variety of skin conditions also to promote quick healing of skin lesions so as [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1128,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1127"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=1127"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1127\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/1128"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=1127"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=1127"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=1127"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}