{"id":1133,"date":"2016-11-13T07:08:51","date_gmt":"2016-11-13T07:08:51","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=1133"},"modified":"2016-11-13T07:08:51","modified_gmt":"2016-11-13T07:08:51","slug":"eating-right-for-a-healthy-skin","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/eating-right-for-a-healthy-skin\/","title":{"rendered":"Eating Right for a Healthy Skin"},"content":{"rendered":"We bring to you all that is the latest and the best in skincare, because this is what we do best. Today we talk about the role that nutrition has on your skin.\n\nEating right has always been the key to a healthy and vibrant skin. Here are some simple changes that you can make in your diet to make sure that your skin gets healthy and stays that way.\n\n<strong>1. Olive Oil<\/strong>\n\nOlive oil is a rich source of mono saturated fatty acids. Swap your regular oil with olive oil for a healthy skin. Research shows, in fact that people who consumed more olive oil showed fewer signs of ageing when compared to people who had less of it.\n\nOlive oil is also a rich source of the antioxidant polyphenol which works by quenching free radicals from the blood.\n\n<strong>2. Tomatoes<\/strong>\n\nTomatoes are a rich source of the antioxidants lycopene, which is a powerful antioxidant, this compound is known to boost your skin’s natural defence against Sunburn by boosting its SPF.\n\nLevels of lycopene are higher in cooked or processed tomatoes when compared to regular, raw tomatoes.\n\n<strong>3. Dark chocolate<\/strong>\n\nDark chocolate is a rich source of cocoa flavanols. These are plant compounds with antioxidant properties. The compound helps hydrate skin and is known to improve circulation as well.\n\nBut make sure you watch how much of this delicious stuff you eat, it is also a very good source of excess calories.\n\n<strong>4. Sardines<\/strong>\n\nEating sardines (or any kind of fish for that matter) can keep your skin healthy. How is that? Fish are a rich source of omega 3 fatty acids, which is quite frankly, the best source of fat that you can get your hands on.\nFish high on fat content a compound called DHA (dihydroxyacetone) which is a powerful antioxidant and an anti-inflammatory agent, inflammation has been known to be deep rooted cause of pimples and acne.\n\n<strong>5. Walnuts<\/strong>\n\nWalnuts are vegetarian alternative to fish. Vegetarians often miss out on some key nutrients like Vitamin B12 and Essential Omega Fatty Acids Walnuts\n\n<strong>6. Water<\/strong>\n\nAnother simple dietary modulation that you can make is by simply increasing the volume of water that you consume every day. Drinking more water every day will help you excrete more toxins each day. And when your body gets rid of the toxins, you get healthier skin.\n\nWater also helps keep your skin hydrated. And the more hydrated and plump your skin is the healthier and less wrinkled it appears.\n\n<strong>7. Soy<\/strong>\n\nSoy is a very rich source of proteins. Proteins that are rich source of aglycone (soy isoflavin). This is great for stopping wrinkles from appearing in the first place by preventing the breakdown of collagen.\n\n<strong>8. Coffee<\/strong>\n\nCoffee helps prevent cancer. In a study, women who had coffee everyday had an 11% decreased risk of skin cancer. And upping your consumption to 6 cups every day is sure to get your risk down by 30%.\n\n<strong>9. Kiwi<\/strong>\n\nThis little fruit packs vitamin C like a pro. With one single fruit having about 120% of your daily Vitamin C needs. Vitamin C is essential for repair and maintenance of your skin’s collagen.\n\n<strong>10. Pumpkin<\/strong>\n\nCooked pumpkin is one of the top sources of beta carotene. Your body converts beta carotene into Vitamin A. Eating just a half a cup of pumpkin every day will make for 400% of your RDA for Vitamin A.\n\n<strong>11. Red Wine<\/strong>\n\nRed wine has been known to reduce the occurrence of actinic keratosis. Having half a glass of red wine in a day will prevent cancer as it contains resveratrol (antioxidant)\n\n<strong>12. Carrots<\/strong>\n\nCarrots are a high source of carotene, eating carrots will give your skin a yellowish pigment that makes it seem healthier.\n\n<strong>13. Chickpeas<\/strong>\n\nA Korean research has concluded that low glycaemic load diet for 3 months straight had healthier skin with less inflammation and pimple outbreaks. Chickpeas have a healthy protein and fibre content, which makes them one of the healthiest foods that you can have today.\n\n<strong>14. Oatmeal<\/strong>\n\nOatmeal breakfasts are the best for a reason, the reason is that not only oatmeals contain plenty of fiber, they are also better than refined wheat and sugar breakfasts as they can cause an insulin spike which will release androgens and will cause the skin to secrete more oil, giving rise to pimples and oily skin.\n\nKeep watching this space for more neat reads like these.\n\n<a href=\"https:\/\/garekarsmdskinclinic.com\/\">Garkars M.D. Skin clinic<\/a> is the best skin clinic for all your skin care needs. Get your appointment today!","protected":false},"excerpt":{"rendered":"<p>We bring to you all that is the latest and the best in skincare, because this is what we do best. Today we talk about the role that nutrition has on your skin. Eating right has always been the key to a healthy and vibrant skin. Here are some simple changes that you can make [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1134,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1133"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=1133"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1133\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/1134"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=1133"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=1133"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=1133"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}