{"id":1136,"date":"2016-11-15T04:35:55","date_gmt":"2016-11-15T04:35:55","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=1136"},"modified":"2016-11-15T04:35:55","modified_gmt":"2016-11-15T04:35:55","slug":"keep-skin-safe-pollution","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/keep-skin-safe-pollution\/","title":{"rendered":"How to Keep Your Skin Safe from Pollution"},"content":{"rendered":"The last couple of days, pollution levels in Delhi NCR have been through the roof. The pollution levels are so high in fact that this is being described as the worst smog in 17 years.\n\nCommon pollutants include- Smog, Dirt, Dust, Debris, Vehicle Exhaust, Carbon Monoxide, Ozone, Nitrous Oxide, Toxic metals, Ammonia.\n\nPollution is not good for your health in general, but it is worse for your skin. Air pollutants can penetrate the skin’s natural barrier, and even though the results of this penetration are not immediately visible, they can cause some long term damage.\n\nHere’s what pollution can do to your skin.\n\n1. Air pollution can decrease moisture and elasticity in your skin\n2. Can lead to a surprise outbreak of acne\n3. Can cause otherwise healthy skin to appear dull and dry\n4. Can lead to the outbreak of eczema\n5. Various heavy metals can result in skin allergies\n6. Dirt and other particles can lead to skin rashes\n7. Can increase the appearance of wrinkles\n\nBut the good news is that there are steps one can take to minimize and prevent skin damage caused because of pollution, they are\n\n<strong>1. Modulating your diet<\/strong>\n\nIt helps if your skin can resist damage from the inside, for that to happen you need to make certain changes to your diet that help boost your skin’s natural immunity to pollutants.\n\nEating a lot of fruits and vegetables that are a rich source of vitamins and minerals can help your skin develop natural immunity against these pollutants.\n\nYou can also try supplements for these minerals and vitamins.\n\n<strong>2. Drink lots of water<\/strong>\n\nStaying hydrated helps your skin stay elastic and keeps it moist, thereby helping boost its protective properties against outside elements.\n\nDrinking sufficient water is also going to help you excrete toxins from your body.\n\n<strong>3. Use the right skin products<\/strong>\n\nYou need the right products when you want to go out in the polluted air, remember, products that are oily and get your skin moist are going to trap more pollutants than usual, make sure you keep makeup to a minimum. Get a quality sunscreen, and at the end of the day, wash all of it off rigorously.\n\n<strong>4. Exfoliate<\/strong>\n\nExfoliation helps you get rid of pollutants and contaminants that have seeped through to the deeper layers of your skin, use a quality scrub and keep the count under three times a week, as too much exfoliation can also damage skin.\n\n<strong>5. Moisturize every day<\/strong>\n\nAll the washing will have your skin stripped of its natural moisture. Moisturize every day to make sure that you so not suffer from dry skin. Use a heavy moisturizer during the evening and a light moisturizer with SPF in the day.\nYou can also use exfoliating brushes.\n\n<strong>6. Use masks and peels<\/strong>\n\nMasks and peels engage debris that is often hard to remove. These are some of the best in home treatments that you can get for fighting pollution damage.\n\n<strong>7. Get an air purifier<\/strong>\n\nAir purifiers ensure that pollution stays outside your house and that you are at least protected inside your home.\n\n<strong>8. Cover up<\/strong>\n\nOf course, one of the best ways to save yourself from pollution and damage is by covering up your face with a pollution protection mask.\n\n<strong>9. Consult a specialist<\/strong>\n\nIf you want to know of more ways to fight pollution and keep your skin healthy against pollution is to consult a dermatologist for a list of precautions that are personalized for your skin type and tone.\n\nFor the best dermatologist in DLF Phase 1, Gurgaon, find your way to <a href=\"https:\/\/garekarsmdskinclinic.com\/\">Garekars M.D. Skin Clinic<\/a>.\n\nBook your appointment today.","protected":false},"excerpt":{"rendered":"<p>The last couple of days, pollution levels in Delhi NCR have been through the roof. The pollution levels are so high in fact that this is being described as the worst smog in 17 years. Common pollutants include- Smog, Dirt, Dust, Debris, Vehicle Exhaust, Carbon Monoxide, Ozone, Nitrous Oxide, Toxic metals, Ammonia. Pollution is not [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1137,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1136"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=1136"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1136\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/1137"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=1136"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=1136"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=1136"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}