{"id":1140,"date":"2016-11-22T09:22:08","date_gmt":"2016-11-22T09:22:08","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=1140"},"modified":"2016-11-22T09:22:08","modified_gmt":"2016-11-22T09:22:08","slug":"herbal-skin-care-home","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/herbal-skin-care-home\/","title":{"rendered":"Herbal Skin Care at Home"},"content":{"rendered":"Getting a healthy, glowing skin is no easy feat. Just ask anybody who suffers from constant skin problems like acne, white and blackheads and oily skin and they will tell you of the hundreds of things that they do every day and the thousands of sacrifices they make every day to keep their skin healthy.\n\nSkin problems affect men and women both, causing image issues and distress to the people who are affected. Women, in general are more concerned by the condition of their skin than men, and will try a variety of solutions for their skin problems including some rather expensive and hyped cosmetics that claim to do so much but more often than not, do so little.\n\nThese cosmetics can provide temporary relief from the situation, nothing more. It is also worth a mention here that some of these cosmetics can react adversely with your skin and can do more damage than good.\n\nHere are some herbal remedies that are not only side effect free, but also use easy to find ingredients (you can probably get all of these at your local drug and grocery store).\n\n1. Mix up (or blend) some Cucumber Juice with Rose water and Glycerine, apply the paste to your skin and let it stay for 20 minutes or so, rinse with water. The mix protects your face from sun damage and darkening.\n\n2. Another great remedy for healthy glowing skin is carrots. Not only does drinking the juice help, putting on the juice (or the pulp) will get your skin a healthy glowing tinge.\n\n3. Mix up a spoonful of turmeric with some sandalwood and milk and make a thick paste. Apply this mixture to your face and let it stand for 30 minutes. Turmeric has a high antioxidant activity and a bright yellow tinge that gets your skin radiant and healthy.\n\n4. If you are fed up with the constant outbreaks of black and white heads, mix a dollop of freshly squeezed lime juice with some groundnut oil, apply this mixture to your every other day for about 10 minutes and was off. Helps prevent back\/ white head outbreak.\n\n5. You can also mix some honey and apply to your face, this remedy works best for dry skin types. Honey and cream both moisturise the skin and make it feel supple, healthy and bright.\n\n6. Grapes are naturally high in antioxidants (polyphenols) and while eating grapes is beneficial for your skin as well, you can also crush them and make a paste that you can then use to scrub your skin with.\n\n7. Aloe Vera juice when applied to skin (preferably freshly extracted) will help with de-pigmentation of your skin. If you want to get rid of all the excess tan that you have, go get some aloe vera!\n\n8. For dry skin, you can also use a paste made of glycerine and margarine, this not only moist your skin up, but also gives you the healthy, supple glow that you want.\n\n9. Another very healthy source of antioxidants is tomato. You can use tomato juice on your skin every alternate day. Just blend in some tomatoes and apply the juice on your face for about 20 minutes before rinsing off, continued use will produce excellent results.\n\n10. For overnight packs, you can use cinnamon powder mixed with honey. Grind some fresh cinnamon powder and mix it with a table spoon of honey. Apply on your face and leave overnight. Both of these substances are bactericidal and will prevent acne and pimples (even the most resilient ones)\n\n11. Applying a mixture of turmeric seeds, sesame oil and wheat flour will help remove excess hair naturally. Turmeric is a natural antibiotic so you don’t need to worry about infections.\n\n12. Wrinkles stealing your thunder? Fret not, just mix up a fresh batch of cabbage juice and honey for a tight, healthy, supple skin. Apply and leave for half an hour before washing off.\n\n13. Multani mitti will remove all dead skin cells and make space for skin to breath, the material is also known for its capacity to prevent outbreak of pimples. Multani mitti will also add a subtle glow to your skin that is easily observed.\n\n14. Apply a paste of yogurts and apricots for a fresh and healthy skin, if your face is dry than add honey to the mixture.\n\n15. Milk and Lime juice when mixed, work great for exfoliation of dirt and debris from skin. A must try after a hard day’s work.\n\nFollow all these simple and easy to use home remedies to get the best version of your skin today and keep watching this space for more interesting reads like these.\n\nFor the best Skin Clinic in DLF Phase 1, Gurgaon, make sure you visit <a href=\"https:\/\/garekarsmdskinclinic.com\/\">Garekars M.D. Skin Clinic<\/a>.","protected":false},"excerpt":{"rendered":"<p>Getting a healthy, glowing skin is no easy feat. Just ask anybody who suffers from constant skin problems like acne, white and blackheads and oily skin and they will tell you of the hundreds of things that they do every day and the thousands of sacrifices they make every day to keep their skin healthy. [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1141,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1140"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=1140"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1140\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/1141"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=1140"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=1140"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=1140"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}