{"id":1143,"date":"2016-11-25T06:16:10","date_gmt":"2016-11-25T06:16:10","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=1143"},"modified":"2016-11-25T06:16:10","modified_gmt":"2016-11-25T06:16:10","slug":"your-skin-explained","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/your-skin-explained\/","title":{"rendered":"Your Skin &#8211; Explained"},"content":{"rendered":"Today we will talk to you about something that we specialize in, something that we feel you should know more about. Of course, we are talking about your skin. In today’s post we will cover everything there is to know about your skin and more over some interesting skin facts.\n\nThe skin falls under a special organ system called the integumentary system, whose job is to protect your body from all kinds of damage, such as – loss of water, abrasion from outside elements, infections etc. Other tissues that are parts of the integumentary system are, appendages, hair nails etc.\n\nYour skin is a very important and complicated structure that is comprised primarily of three layers- epidermis, dermis and hypodermis, each layer with its own structure and function.\n\n<strong>The Epidermis<\/strong>\n\nThis is the top layer of skin and does not contain blood vessels. This layer is 40 to 50 cell layer thick and measures merely one tenth of a Millimetre. The cell layer contains cells called Keratinocytes, these cells are responsible for the release of keratin which is the stuff that makes your skin impervious (mostly) to water.\n\n<strong>The Dermis<\/strong>\n\nThe dermis is the middle layer and it actually has two layers, these multiple layers provide elasticity to the skin and are responsible for fighting wrinkles and sagging skin. Also, hair follicles are found in this layer.\n\n<strong>The Hypodermis<\/strong>\n\nThe hypodermis is the deepest layer of the skin that is responsible for insulating internal organs and cushioning internal organs. The hypodermis is comprised chiefly of fat tissue, which not only act as storage of energy but also act as a kind of cushion for the skin and provides tenacity to the skin.\n\nThe colour of your skin is derived from cells that are called melanocytes, these cells absorb the UV rays of the sun and gain pigment. Amongst other cells that your skin contains are mesodermal cells, squamous cells, basal cells, collagen fibres, fat cells, keratin, etc,\n\nYour skin has areas that are keratinised and areas that are not keratinised, all these areas also have their specific functions. Like, the area on your palm and soles of your feet is keratinised as these are the places that you will use to interact with your surroundings the most. Keratinisation is a kind of layer by layer deposition of dead skin cells to protect the underlying cells from vigorous or damaging stimuli.\n\nYour skin also has small glands called the sweat glands, these glands will excrete sweat that is a body liquid that helps in elimination of waste products and homeostasis (regulation of body temperature).\n\nYour skin plays a vital role in protecting you from the outside environment, maintaining a separate internal environment and protecting delicate organ systems from infections and damage.\n\n<strong>The skin has 8 core functions-<\/strong>\n\n1. Protection &#8211; from outside contaminants.\n\n2. Sensation- to and from the brain.\n\n3. Heat regulation &#8211; by insulation of the internal environment.\n\n4. Control of evaporation of bodily fluids and viscera.\n\n5. Aesthetics and communication &#8211; your mood can be judged by the tone of your skin.\n\n6. Storage and Synthesis &#8211; of energy and nutrients that are essential for the skin, skin also helps in secretion of Vitamin D, an essential vitamin for your body functions.\n\n7. Excretion- your skin has sebaceous glands that help in excretion of waste products from your body.\n\n8. Absorption- your skin also absorbs oxygen and the epidermis is dependent on this oxygen for its function.\n\n9. Water resistance – Your skin has a layer of keratin on it which prevents the exchange of bodily fluids when you are submerged in water.\n\nAll these functions are performed by your skin, every single day. This is why your skin is one of the most important organs of your body.\n\n<strong>Here are some interesting skin facts that you probably did not know.<\/strong>\n\n1. Your skin covers an area of 2 square meters.\n\n2. Your skin is about 15% of your weight.\n\n3. Your skin has 18 kilo meters of blood vessels supplying it.\n\n4. The skin is thickest at your feet and thinnest at your eyelids.\n\n5. Your skin renews itself every 28 days.\n\n6. Dead skin cells comprise a large portion of the earth’s dust.\n\n7. More than a 100 species of bacteria have been discovered to reside on skin.\n\n8. Your skin has 5 different types of receptors that respond to pain and touch.\n\n9. Changes in your skin can be a signal of some deeper conditions that affect you.\n\nWhen your skin does so much for you, why not give a little love back, find your way to <a href=\"https:\/\/garekarsmdskinclinic.com\/\">Garekars M.D. Skin Clinic<\/a> for the best dermatological consultation and treatments in DLF Phase 1 Gurgaon.\n\nFor more interesting reads like these, keep watching this space.","protected":false},"excerpt":{"rendered":"<p>Today we will talk to you about something that we specialize in, something that we feel you should know more about. Of course, we are talking about your skin. In today’s post we will cover everything there is to know about your skin and more over some interesting skin facts. The skin falls under a [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1144,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1143"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=1143"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1143\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/1144"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=1143"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=1143"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=1143"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}