{"id":1240,"date":"2017-02-24T08:14:35","date_gmt":"2017-02-24T08:14:35","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=1240"},"modified":"2017-02-24T08:14:35","modified_gmt":"2017-02-24T08:14:35","slug":"how-to-care-for-dry-skin","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/how-to-care-for-dry-skin\/","title":{"rendered":"How to Care for Dry Skin"},"content":{"rendered":"Dry skin can be a tremendous hassle. Especially during the winter season, there are some simple things that you can do, however, that make the entire process of getting healthy, bright and supple skin possible without breaking a sweat.\n\nAt Garekars M.D Skin Clinic we have all the right solutions for all your skin care needs. Which is why, we have compiled a list of 9 small lifestyle changes that you can make this winter season to prevent the onset of dry, damaged skin.\n\n<strong>1. Shower the right way<\/strong>\n\nWhen you shower, make sure you use lukewarm water instead of hot water. Your skin will love you for it. Hot water rids your skin of essential oils by dissolving them and moving them out of the pores of your skin.\n\nMaking sure your bathroom doors are closed ensures that dry, cold winter air stays outside where it is supposed to. You should also avoid long baths during winters. And steer clear of any perfumed products as they may contain alcohol, and alcohol dehydrates the skin.\n\nAlso, avoid scrubbing your skin dry, blot dry instead.\n\n<strong>2. Use moisturizer immediately after washing<\/strong>\n\nThis holds true for face washes and hand washes as well. Whenever you expose your skin to water during the winter season, your skin loses the protective layer of moisturizer that you apply on it. You need to moisturize as many times as you wash, bathe and clean your hands even.\n\nYou must apply moisturizer immediately as well. We suggest that you keep a small bottle handy for travel.\n\n<strong>3. Use ointments rather than lotion<\/strong>\n\nLotions work, but ointments work better. Make sure you keep a quality moisturizer with you at all times. Lotions also tend to spill while ointments are easier to manage. When you look for an ointment, make sure you look for one that has natural oils like olive oil or jojoba oil. Mineral oil and other chemical oils work as well, but there is no replacement for natural remedies.\n\n<strong>4. Always use a lip balm<\/strong>\n\nYou need to care for your lips as much as you care for your skin. This is because the skin on your lips is thinner and more prone to exposure than the skin on your body. It’s a great idea to keep a Chap Stick or lip balm handy and use them frequently and regularly.\n\nAgain, we suggest using a lip balm that has natural ingredients vis-à-vis chemical ones. There are some great organic products available in the market today. Make sure you try a few out before deciding which one suits you best.\n\nPetroleum jelly also works just as well.\n\n<strong>5. No perfumes, please<\/strong>\n\nPerfumes are the modern man\/woman’s arsenal to not just looking great but smelling great as well. But perfumes contain large amounts of alcohol (this helps with the dispersion of the fragrance), alcohol can dehydrate your skin rapidly leaving dry patches that can become red and inflamed. Avoid using perfumes during those cold winter parties.\n\nOne quick workaround to this situation is to wear your perfume on your clothes instead.\n\n<strong>6. Gloves are a must<\/strong>\n\nHands are generally the most ignored part of your body, even though they do most of your interaction for you. Soft, supple and well cared for hands speak a lot about your attention to detail in personal care.\n\nFor hands, petroleum jelly works best. You can also carry a small moisturizer bottle with you at all times.\n\nBut all this can become hard to manage when you have to ride a bike to work. Or when your job profile includes keeping you outside, for these situations, you need to keep quality leather gloves with you at all times. Leather gloves, because fabric gloves do not trap moisture the way that leather gloves do.\n\n<strong>7. Use a gentle laundry detergent<\/strong>\n\nIt is really easy to irritate dry skin. Small scratches from nails, rough surfaces, and even rough clothes can cause your dry skin to become itchy and inflamed. You need to make sure that you use a safe, gentle detergent for all your washes this winter season. Liquid detergents that are designed keeping delicate woolens in mind work well for all your regular clothes too.\n\n<strong>8. Keep away from the fireplace<\/strong>\n\nSitting next to a fire can seem like the most comforting thing in cold winter evenings. But winters are dry, very dry. And when you heat cold dry air, you are left with hot dry air. And there are few things that do more damage to your skin than hot dry air.\n\nHot, dry air, will quickly rid your skin of all its moisture owing to its heat. If you still want to get cozy in front of a fireplace or a heater.\n\nYou might want to.\n\n<strong>9. Get a humidifier<\/strong>\n\nYou can’t control what the weather is like outside. But you can control what it feels like inside. Humidifiers work by constantly vaporizing water so that your home’s internal humidity level stays high.\n\nA good humidifier will never let your skin dry out when you are inside your house.\n\nFollow these simple routines\/ lifestyle modifications to get the supple, healthy and glowing skin you want. If problems persist, maybe it’s time to seek out expert consultation, from skin specialists at <a href=\"https:\/\/garekarsmdskinclinic.com\/\">Garekars M.D. Skin Clinic<\/a>.","protected":false},"excerpt":{"rendered":"<p>Dry skin can be a tremendous hassle. Especially during the winter season, there are some simple things that you can do, however, that make the entire process of getting healthy, bright and supple skin possible without breaking a sweat. At Garekars M.D Skin Clinic we have all the right solutions for all your skin care [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1241,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1240"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=1240"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1240\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/1241"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=1240"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=1240"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=1240"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}