{"id":1254,"date":"2017-03-12T11:28:35","date_gmt":"2017-03-12T11:28:35","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=1254"},"modified":"2017-03-12T11:28:35","modified_gmt":"2017-03-12T11:28:35","slug":"10-ways-in-which-you-can-get-smooth-and-lustrous-hair-this-holi","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/10-ways-in-which-you-can-get-smooth-and-lustrous-hair-this-holi\/","title":{"rendered":"10 Ways in Which You Can Get Smooth and Lustrous Hair This Holi"},"content":{"rendered":"The festival of colours is one of the most highly celebrated festivals in India and plays a very significant role in defining our country and its culture. This is the day which signifies the victory of good over evil, and welcomes the arrival of spring. Love dominates the atmosphere and the hearts of the people. Most often we’re so indulged in the pichkaris, gulaals and water balloons that we completely forget about what all the chemicals present in the colours could do to our hair. Some people protect their bodies by wearing certain kinds of clothes, whereas some use lotions to keep their respective skin tones from getting affected too much. But what about the hair? People take very little or no precaution at all, to protect it from getting damaged.\n\nLet me tell you exactly what kind of effect the colours have on your hair, and why it needs to be protected. It consists of solvents like lead, aromatic compounds, triethylamine and benzene and some of the darker shades of colour, like red, green, black and blue contain mercury sulphite, copper sulphate and lead oxide in an excessive amount. When all of these chemicals come in contact with your skin, it leads to the eruption of rashes, allergy- along with various other skin problems. So, what kind of effect do you think it’ll have on your hair, which is more fragile compared to the skin?\n\nHere are six tips you can keep in your mind before you go out to play Holi:\n\n<strong>1. Oil your hair.<\/strong>\n\nCoconut, Olive Oil, Castor Oil or even Jojoba Oil should be applied to your hair 20 minutes before you start playing Holi. It helps in smoothing the texture of your hair, and doesn’t let the colours to stubbornly stick to your hair strands. It makes it easier for the colours to be washed off later on. It also prevents your hair from getting too dry because of the powdered colours. No matter what kind of colours your hair gets splashed with, oil will prevent it from getting damaged.\n\nThis is a very integral precaution because oil almost does 90% of protection by building a thick layer around your hair.\n\n<strong>2. Lemon drops on your scalp.<\/strong>\n\nIf you have a sensitive skin, then make sure to put a few drops of lemon juice to your scalp to make sure no infection finds its way onto your scalp. Lemon is composed of citric acid, which kills any kind of bacteria which may irritate your skin or trigger a negative reaction.\n\n<strong>3. Roll your hair into a bun.<\/strong>\n\nIf you keep your hair open, it will be easier for the chemicals to find shelter within your hair. Tying your hair into a tight bun will act as a barrier against the colours.\n\n<strong>4. Don’t wash your hair.<\/strong>\n\nThere’s no point in washing your hair before Holi because after playing with the colours, you’d have to wash your hair again, and washing your hair so frequently will lead to your hair looking dry and lifeless. It will strip your hair out of the necessary amount of oil and moisture that is required for lustre.\n\n<strong>5. Wrap a dupatta around your head.<\/strong>\n\nIf you’re interested in taking severe precautions for your hair, you can always wrap your head with a dupatta\/scarf. It will not only save you from colours, but it will also protect your hair and skin from the sun. Holi always takes place in the scorching heat of summer, so wearing a dupatta will definitely prevent your skin from getting a tan, and also act as a camouflage for your hair.\n\n<strong>6. Hydrate yourself.<\/strong>\n\nThe combination of dehydration and the chemicals present in the colours can be deadly. So make sure, you drink an ample amount of water before and during Holi.\n\nHere are the tips you need to keep in your mind, after playing Holi:\n\n<strong>7. Rinse your hair with normal water.<\/strong>\n\nThe powdered colours need to thoroughly get out of your hair, or else you’d have to use the shampoo more than once in a single day, which will make the hair look shrivelled and worn out. Expose your hair to running water and let all the colours flow away first.\n\n<strong>8. Wash your hair with a strong shampoo.<\/strong>\n\nThe shampoo needs to be intricately massaged onto the scalp, to avoid any remnants of the colours to stay stuck near the roots. If they’re not gotten rid of, hair fall will be promoted. Make sure that the shampoo that you use is strong enough to be effective in the first wash. If you use a mild shampoo, you would have to go through the hassle of washing your hair again within a short span of time.\n\n<strong>9. Get back the moisture.<\/strong>\n\nThe texture of your hair is bound to get rough because of its exposure to chemicals, heat, and excessively strong shampoo. Invest in a good conditioner and apply it to the surface of your hair. This can only be done after making sure that your hair is almost, if not completely, free of colours.\n\n<strong>10. Hair mask.<\/strong>\n\nIt’s always safe to treat your hair with a good mask made up of homemade recipe to avert further deterioration of your hair’s quality. It’s better to be safe than sorry later.\n\nThe most commonly used homemade hair mask is made up of the following ingredients:\n\n<strong>a) Curd and lemon.<\/strong>\n\n1-3 tablespoons of lemon juice should be added to 1 full bowl of unsweetened curd and then mixed thoroughly, forming a thick paste. It has to be applied to the hair, with special attention paid to the surface and then rinsed with lukewarm water after 30 to 35 minutes. It softens your hair strands and also takes care of the remaining hue of colours present in your hair.\n\n<strong>b) Honey and olive oil.<\/strong>\n\nTwo tablespoons of honey should be added to two tablespoons of olive oil. Then it should be massaged properly on both the surface of your hair and also the roots and then left idle for 20 minutes for the ingredients to come into effect.","protected":false},"excerpt":{"rendered":"<p>The festival of colours is one of the most highly celebrated festivals in India and plays a very significant role in defining our country and its culture. This is the day which signifies the victory of good over evil, and welcomes the arrival of spring. Love dominates the atmosphere and the hearts of the people. [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1255,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[6],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1254"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=1254"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/1254\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/1255"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=1254"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=1254"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=1254"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}