{"id":2222,"date":"2019-05-20T15:21:01","date_gmt":"2019-05-20T09:51:01","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=2222"},"modified":"2019-05-20T15:21:01","modified_gmt":"2019-05-20T09:51:01","slug":"summer-skin-problems","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/summer-skin-problems\/","title":{"rendered":"4 Common Summer Skin Problems and How to Treat Them!"},"content":{"rendered":"During the summer months, we see many patients suffering from a myriad of skin problems from acne to folliculitis and skin irritation. Though everyone does try their best to ensure that their skin care routine is as comprehensive as possible, environmental issues can still lead to many skin concerns. Let’s take a look at some of the most common summer skin problems that we see, along with how you can treat them!\n<h2>Folliculitis<\/h2>\nFolliculitis can look a lot like acne, but the two conditions are quite different. In this, the follicular openings in the skin (which is where the hair grows out of) starts getting infected. This infection can lead to the accumulation of pus and bacteria, leading to breakouts that look like acne.\n\n<strong>How to treat this?<\/strong>\n\nIn order to treat this at home, boil a few neem leaves in water and then add the same to your bathing water. The neem acts as a natural disinfectant and can reduce the infections in your follicles.\n<h2>Acne<\/h2>\nMany people experience a heavier acne breakout in the summer than they do in the winter months. This is because the sweat and daily grime on your skin mix together and clog up the pores all over the body. When your pores are clogged, bacteria accumulates within them, leading to acne. This can happen on your face, back, arms, really anywhere!\n\n<strong>How to treat this?<\/strong>\n\nAcne can often be annoying to treat at home as you may think you’ve gotten rid of it, only to wake up with fresh blemishes again! Using products that do not clog your pores is one way to go about it. Additionally, you must blot out sweat from the skin as often as you can. Refrain from wearing tight clothes as they may irritate your skin further and lead to more acne. Herbal supplements, such as neem supplements, can help to some extent, but don’t take those without consulting a doctor. Another effective way to combat acne-prone skin is to <a href=\"https:\/\/garekarsmdskinclinic.com\/korean-skin-care-routine-oily-skin\/\">incorporate a Korean skin care routine for oily skin<\/a> in your skin care regimen.\n<h2>Prickly heat<\/h2>\nPrickly heat is another extremely common skin issue that we see during the summer months. This basically occurs when the sweat glands on your body are blocked. Sweating is a natural response to heat and when your glands are blocked, the sweat just accumulates under the skin. Due to this, people see rashes and experience an itchy sensation. When the sweat accumulated under the skin bursts out, it leads to a prickly feeling, which is why this issue is known as prickly heat.\n\n<strong>How to treat this?<\/strong>\n\nOne of the best ways to prevent prickly heat from occurring is by wearing light, loose clothes that allow the flow of air under the garments. Make sure that you stay in areas with air conditioning or at least a fan. There are many powders available in the market, such as DermiCool which create a cooling sensation on the body when you sweat. This can also help combat prickly heat. Sometimes, using Aloe vera or Lacto Calamine lotion can also help.\n<h2>Dry and irritated skin<\/h2>\nOften, spending time outdoors can lead to your skin becoming dry and irritated. This may sound a bit odd as you probably think you’re always covered in sweat, which is why dry skin sounds really far from your reality! But just because you’re sweating doesn’t mean that you don’t have dry skin! Dry skin occurs as a response to sweat as your skin does not produce enough sebum. As a result, it always feels a little itchy and dry. The condition can heighten if you are a swimmer or spend a lot of time in direct sunlight.\n\n<strong>How to treat this?<\/strong>\n\nThere are many different ways to combat dry skin. For instance, if you are a swimmer, then it is important that you shower right after swimming to wash off the chlorine. Make sure that you also shampoo your hair to prevent any damage to your locks. Always use sunscreen when you step out of your home. Make sure that you wash your face with mild cleansers instead of harsh face washes as they can also strip away the natural moisture from your skin. Finally, make sure that you use a moisturizer all over your body on a regular basis! If needed, use serums to lock in additional moisture in your face!\n\nThese home remedies can help with both, prevention and treatment. However, if you find that your skin is just not responding to any of these basic tips, you can always head down to our <a href=\"https:\/\/garekarsmdskinclinic.com\/\">Skin clinic in Gurugram for a consultation<\/a>. Sometimes, what looks like a mild skin problem can often be something that requires professional help, which is why it is always more prudent to just let us help you! After all, the sooner you sort out your skin, the sooner you can wear all those crop tops and halters!","protected":false},"excerpt":{"rendered":"<p>During the summer months, we see many patients suffering from a myriad of skin problems from acne to folliculitis and skin irritation. Though everyone does try their best to ensure that their skin care routine is as comprehensive as possible, environmental issues can still lead to many skin concerns. Let’s take a look at some [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":2223,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[9,40,41,42,43],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/2222"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=2222"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/2222\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/2223"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=2222"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=2222"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=2222"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}