{"id":2233,"date":"2019-06-11T13:30:07","date_gmt":"2019-06-11T08:00:07","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=2233"},"modified":"2019-06-11T13:30:07","modified_gmt":"2019-06-11T08:00:07","slug":"oily-skin-care-summer","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/oily-skin-care-summer\/","title":{"rendered":"Simple and Effective Tips for Oily Skin Care in Summer"},"content":{"rendered":"The summer season in India can be searing, with the air itself ready to burn your skin off. With the temperatures so humid and hot, you skin only responds in one way – increasing oil production to combat the effects of the heat on your skin.\n\nNow, though your sebaceous glands mean well, the last thing you want is a layer of oil filming over your face.\n\nSo, to help you keep your skin healthy and oil-free, we’ve got these amazing tips for oily skin care in summer. Straight from the experts, these simple yet effective tips will help you fight your oily skin! Keep reading!\n<h2>1. Cleanse your face properly<\/h2>\nAny skin care technique begins with cleansing properly. Using the incorrect products on your skin can stimulate a range of problems from oily skin to acne, so begin by evaluating your cleanser.\n\nIf you have oily skin, do not increase the number of times you wash your face. Though it may feel like the logical thing to do, it just takes away moisture from your skin, which leads to an increase in the production of sebum.\n\nYou can either use a mild cleaner (like Cetaphil Facial Cleanser), or a mattifying clay cleanser. If you find yourself getting oily throughout the day, refresh your skin with a hydrating mist, preferably a rose one as it functions as a toner too.\n<h2>2. Don’t forget to moisturize!<\/h2>\nYour skin’s high production of sebum occurs because there’s no moisture in it. So don’t think that you should skip the moisturizer because of this! You have to add a good water based moisturizer to your routine.\n\nMake sure that you use an oil-free moisturizer as you don’t want to further clog your pores and cause more problems. Pick a moisturizer that has SPF in it as you must protect your skin from the harmful rays of the sun.\n<h2>3. Use lighter products in the summer!<\/h2>\nIf you’ve been using heavy, oil based essences on your skin, you should switch to the opposite end of the spectrum by using light serums that have ingredients that won’t clog your pores.\n\nIdeally, you should pick a serum that is rich in anti-oxidants because having a layer of the same on your skin can help you combat heat, UV rays, infrared, and other visible rays of the sun. The anti-inflammatory nature of these serums can prevent your skin from reacting to the sun and burning or breaking out, which can further improve its health.\n<h2>4. Keep blotting oil as often as you can!<\/h2>\nWhen your face gets oily, you probably think that the best response is to wash it so that the oil gets swept away by soap and water.\n\nInstead, make sure that you use a blotting paper or a handkerchief frequently to take the oil away. Allow the paper to rest against your skin for a short duration and then pull it away. You’ll see a layer of oil sitting on its surface.\n\nThat’s all you need to remove from your skin. No need for washing!\n<h2>5. Wear water proof makeup!<\/h2>\nWhen your makeup cannot hold up against the sun and heat, it makes you look even oilier and greasier. So, make sure that you wear matte, water proof makeup so that even if you do sweat, your entire look does not get ruined.\n\nSkin care is simple science. Do not overload your skin care with tons of products. Just make sure you are cleaning your skin and adding moisture back into it to combat oily skin in the summer.\n\nHead down to <a href=\"https:\/\/garekarsmdskinclinic.com\/\">our skin care clinic<\/a> for the chat about your skin if you’re tired of oil and acne!","protected":false},"excerpt":{"rendered":"<p>The summer season in India can be searing, with the air itself ready to burn your skin off. With the temperatures so humid and hot, you skin only responds in one way – increasing oil production to combat the effects of the heat on your skin. Now, though your sebaceous glands mean well, the last [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":2234,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[44,45,46],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/2233"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=2233"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/2233\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/2234"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=2233"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=2233"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=2233"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}