{"id":2309,"date":"2020-01-15T19:21:17","date_gmt":"2020-01-15T13:51:17","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=2309"},"modified":"2020-01-15T19:21:17","modified_gmt":"2020-01-15T13:51:17","slug":"everything-about-vitiligo","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/everything-about-vitiligo\/","title":{"rendered":"Everything You Need To Know about Vitiligo"},"content":{"rendered":"Vitiligo is a common skin condition in which your skin cells stop producing melanin, leading to the loss of colour. The primary vitiligo symptoms are the white patches on the skin. Some of the most typically afflicted areas being the hands and feet, nostrils, inside the mouth, genitals, the hearing systems in the ears, and even the back of the eye.\n\nAdditionally, vitiligo can also turn your hair white if the affected areas contain hair follicles (vitiligo hair often looks white or platinum blonde so keep that in mind while keeping an eye out for symptoms). One of the most common misconceptions about vitiligo is that <em>people are born with the condition<\/em>.  <strong><em>This <\/em><em>isn’t true<\/em>!<\/strong>\n\nLike many other health conditions, vitiligo can develop at any point as it is an autoimmune disease, rather than a genetic one. Having said that, experts are still unsure about vitiligo causes beyond identifying the disease to be an autoimmune issue. Let&#8217;s\n<h2>Vitiligo Symptoms<span style=\"font-size: 16px;\"> <\/span><\/h2>\nThe symptoms of vitiligo can differ based on the types of vitiligo one may have. While the characteristic white patches remain constant in both, non-segmental and segmental vitiligo, the way they present can actually be different.\n<ul>\n \t<li><strong>Segmental Vitiligo<\/strong><\/li>\n<\/ul>\nSegmental or focal vitiligo occurs on one side of the body. In this case, vitiligo symptoms include patches that tend to be smaller and spread across a limited area. The growth of the patches can continue for up to a year before slowing down considerably, however, experts are not sure what causes vitiligo to spread, which is why most treatments are not cures, they are only designed to manage the disease.\n<ul>\n \t<li><strong>Non-segmental Vitiligo<\/strong><\/li>\n<\/ul>\nNon-segmental vitiligo is a variant of the condition that is not limited to one side of the body. The patches appear symmetrically on both sides (think of international model Winnie Harlow for example), with the affected areas spanning across the entire body. The condition stops and starts over the course of the patient’s lifetime, with there being no way to predict when more patches will grow, and when they will stop.\n<h2>Complications of Vitiligo<\/h2>\nWhile vitiligo does not typically lead to other health complications, it does have a psychological effect on patients, particularly younger ones who develop this condition during their formative years. Multiple studies indicate that close to <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC5076546\/\">50% of patients<\/a> suffering from vitiligo develop social phobias, with many also reporting the disease-causing negative effects in their marriage or personal relationships. This is why it is essential to get the help you need from someone who is not only qualified to manage the condition, but also to be able to spot behavioral red flags and advise patients to seek further counseling.\n\nMost patients suffering from vitiligo report the following:\n<ul>\n \t<li>Having anxiety<\/li>\n \t<li>Having depression<\/li>\n \t<li>Avoiding social events<\/li>\n \t<li>Feeling emotionally burdened<\/li>\n \t<li>Isolating themselves from people<\/li>\n \t<li>Believing their condition to be on par with disfigurements<\/li>\n<\/ul>\n<h2>Can Vitiligo be cured?<\/h2>\nNo, there is no cure yet found but many <a href=\"https:\/\/garekarsmdskinclinic.com\/vitiligo-treatment-gurgaon\/\">vitiligo treatment<\/a> options are designed to help restore colour balance in a patient’s skin, thereby minimizing the apparent effects of the condition. These treatment types vary from medicinal options to surgical ones and are prescribed on the basis of the severity of the patient’s condition. Do keep in mind whether you have non-segmental or segmental vitiligo, treatment options remain the same. Some of these are as follows:\n<h3>Medicinal Treatments<\/h3>\nYour doctor may prescribe any of the following:\n<ul>\n \t<li><em><span style=\"text-decoration: underline;\">Topical creams<\/span><\/em> that either help restore colour or prevent the spread of white patches to other areas of the skin. As these creams contain corticosteroids, you can expect a few side effects such as skin thinning, irritation, excessive hair growth, and shrinkage.<\/li>\n \t<li><em><span style=\"text-decoration: underline;\">Oral medications<\/span><\/em> that help manage the growth of vitiligo patches.<\/li>\n \t<li><em><span style=\"text-decoration: underline;\">Psoralen and ultraviolet A<\/span><\/em> (PUVA) therapy, a treatment type that requires patients to apply psoralen cream or take pills regularly. Once that is done, the dermatologist exposes your skin to UVA light to resort to the colour of your skin.<\/li>\n \t<li><em><span style=\"text-decoration: underline;\">Narrowband UV light<\/span><\/em>, which is prescribed as an alternative to PUVA and can even be conducted in the patient’s home.<\/li>\n \t<li><em><span style=\"text-decoration: underline;\">Excimer laser treatment<\/span><\/em>, which can help take care of smaller patches and requires multiple sessions to be successful.<\/li>\n \t<li><em><span style=\"text-decoration: underline;\">Depigmentation<\/span><\/em>, which is a treatment offered when all the other skin restoration treatments fail, and vitiligo patches spread to over 50% of the body. In this treatment, dermatologists focus on lightening the skin to match the colour of the patches, rather than making the patches go back to natural colour.<\/li>\n<\/ul>\n<h3><\/h3>\n<h3>Surgical Treatments<\/h3>\nThough surgical treatments are a bit extreme, patients suffering from emotional trauma due to vitiligo can opt for the same. Some of the most commonly prescribed surgical treatments include:\n<ul>\n \t<li>Skin grafting<\/li>\n \t<li>Micropigmentation<\/li>\n \t<li>Melanocyte transplants<\/li>\n<\/ul>\n<div class=\"post-content\"><\/div>\n&nbsp;\n\n[fusion_accordion boxed_mode=&#8221;&#8221; border_size=&#8221;1&#8243; border_color=&#8221;&#8221; background_color=&#8221;&#8221; hover_color=&#8221;&#8221; divider_line=&#8221;&#8221; hide_on_mobile=&#8221;small-visibility,medium-visibility,large-visibility&#8221; class=&#8221;&#8221; id=&#8221;&#8221;][fusion_toggle title=&#8221;Is vitiligo hereditary?&#8221; open=&#8221;no&#8221;]\n\n<span style=\"font-weight: 400;\">Vitiligo is an autoimmune disease, and though parents suffering from autoimmune diseases are likely to pass them on to their children in certain cases. There is no evidence that supports that vitiligo is definitely hereditary. There are many cases where parents have passed the condition onto their children, &amp; an equal number of cases where they haven&#8217;t, which is why this matter still remains a mystery. <\/span>\n\n[\/fusion_toggle][fusion_toggle title=&#8221;How to prevent vitiligo?&#8221; open=&#8221;no&#8221;]\n\n<span style=\"font-weight: 400;\">As experts are unsure about the causes, there are no scientifically proven prevent techniques that patients can use. Many people tend to believe that a healthy diet or the intake of vitamins B12, D, C, beta carotene, enzymes, amino acids, and ginkgo biloba can help prevent the condition, however, this is purely conjecture. Patients are welcome to try these options after speaking to their <a href=\"https:\/\/garekarsmdskinclinic.com\/\">skincare specialists<\/a> to ensure they won’t be saddled with side-effects. <\/span>\n\n[\/fusion_toggle][fusion_toggle title=&#8221;Can vitiligo appear overnight?&#8221; open=&#8221;no&#8221;]\n\n<span style=\"font-weight: 400;\">Yes, the symptoms of vitiligo can appear overnight, however, experts are not sure how long it takes for the symptoms to appear once the body develops the disorder. If you are wondering “how does vitiligo start”, the disease begins with small white patches that eventually spread all over the body. <\/span>\n\n[\/fusion_toggle][fusion_toggle title=&#8221;Vitiligo cure diet – is there such a thing?&#8221; open=&#8221;no&#8221;]\n\n<span style=\"font-weight: 400;\">No, vitiligo cannot be cured via your diet. However, the <em>Vitiligo Support International<\/em> believes that nutrient deficiencies may contribute to the condition worsening. This is probably why you’ve heard people say you must eat <\/span>bananas for vitiligo<span style=\"font-weight: 400;\">. It’s vital to know that there is absolutely no scientific evidence that supports this theory, though some patients do believe that consuming certain foods like apples, leafy greens, chickpeas, bananas, beets, carrots, figs, radishes, and dates proved to be helpful for their condition.<\/span>\n\n[\/fusion_toggle][\/fusion_accordion]","protected":false},"excerpt":{"rendered":"<p>Vitiligo is a common skin condition in which your skin cells stop producing melanin, leading to the loss of colour. The primary vitiligo symptoms are the white patches on the skin. Some of the most typically afflicted areas being the hands and feet, nostrils, inside the mouth, genitals, the hearing systems in the ears, and [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":2315,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/2309"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=2309"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/2309\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/2315"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=2309"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=2309"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=2309"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}