{"id":288,"date":"2016-05-26T09:50:35","date_gmt":"2016-05-26T09:50:35","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=288"},"modified":"2016-05-26T09:50:35","modified_gmt":"2016-05-26T09:50:35","slug":"10-simple-ways-to-care-for-your-skin-in-summers","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/10-simple-ways-to-care-for-your-skin-in-summers\/","title":{"rendered":"10 Simple Ways to Care for Your Skin in summers"},"content":{"rendered":"Its summer time and it is no revelation that the season has its fair share of <a href=\"https:\/\/garekarsmdskinclinic.com\/summer-skin-problems\/\">skin problems<\/a>&#8211; Acne, sun-burns, rashes and skin infections, just to name a few, but you can maintain your skin and keep it healthy when you follow these simple steps.\n\n<strong>1. Protect your scalp<\/strong>\n\nYour scalp needs sun protection too. Think about it, when you protect your skin, why would you ignore your scalp.\n\nWhich is why, before you head out in the sun make sure that you use physical barriers like caps and hats, or better yet, carry an umbrella, this helps you protect not only your scalp, but your face as well.\n\n<strong>2. Take cold showers<\/strong>\n\nTaking cold showers helps unclog your skin in the best ways possible. Warm water showers dehydrate the skin further.\n\n<strong>3. Exfoliate just before<\/strong>\n\nIt is a great idea to exfoliate just before the shower to get rid of all the sweat and dirt build up that you might be harboring inside of your pores.\n\n<strong>4. DIY Summer Scrub<\/strong>\n\nDon’t know what scrub you should use, try this one.\n\na. Take a cup full of salt\nb. A cup full of ground coffee beans\nc. A cup full of sesame oil\nd. A cup full of eucalyptus oil\n\nMix all the ingredients together and use the scrub while in the shower, all over your body, it will leave you feeling energized and ready.\n\n<strong>5. Melons are good<\/strong>\n\nMelons aren’t just delicious; they are also a very rich source of antioxidants and deliver unique hydration for the skin. The fruit also delivers natural SPF factors which help protect your skin intrinsically.\n\n<strong>6. Use an under eye protective cream<\/strong>\n\nThe area under your eyes is very susceptible to sun damage. The best way to make sure that you steer clear of under eye wrinkles, dark spots and bags is that you start using an under eye protective cream that is high in SPF and antioxidants.\n\n<strong>7. Carry a face mist at all times<\/strong>\n\nA face mist that contains antioxidants and SPF will prevent sun damage and also give you the cool sensation that you need to beat the heat\n\n<strong>8. Have lots of Vitamin C and E<\/strong>\n\nStudies have established that consuming increased doses of Vitamin C and E can help prevent outbreaks of acne, pimples, as well as degeneration of skin because of sun damage.\n\n<strong>9. Use a cool face mask<\/strong>\n\nIf there was a time to use the Neem and Multani mitti face mask made in cucumber juice it is now. The face mask has antibacterial properties along with the right cooling effect.\n\n<strong>10. Protect those lips<\/strong>\n\nYour lips are also sensitive sites for skin damage. And you must protect them with an SPF 30 or higher lip balm.\n\nFor more skin health and maintenance related information, keep watching this space.","protected":false},"excerpt":{"rendered":"<p>Its summer time and it is no revelation that the season has its fair share of skin problems&#8211; Acne, sun-burns, rashes and skin infections, just to name a few, but you can maintain your skin and keep it healthy when you follow these simple steps. 1. Protect your scalp Your scalp needs sun protection too. [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":315,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/288"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=288"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/288\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/315"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=288"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=288"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=288"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}