{"id":380,"date":"2016-05-28T09:50:22","date_gmt":"2016-05-28T09:50:22","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=380"},"modified":"2016-05-28T09:50:22","modified_gmt":"2016-05-28T09:50:22","slug":"easy-home-remedies-to-zap-that-zit","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/easy-home-remedies-to-zap-that-zit\/","title":{"rendered":"Easy Home Remedies to Zap that Zit"},"content":{"rendered":"Acne is a very common skin problem (especially amongst the youth) and while medical intervention may sometimes be called for, natural measures have their own place.\n\nNatural measures are way more convenient than the medical ones, but medical ones may be called for in extreme and recalcitrant (read &#8211; recurrent) cases.\n\nAcne occurs when dirt, dead skin cells and other toxins clogs pores and the oil gets trapped within, causing bacterial infection. This results in the breakout of pimples on the skin. And there are time tested home remedies that can zap that zit in no time.\n\nThese home remedies include:\n\n<strong>1. Cinnamon<\/strong>\n\nCinnamon is rich in natural hydrogen peroxide, hydrogen peroxide helps in getting rid of unwanted bacteria and other infection causing agents on the skin, use this in combination with honey to get the best results. Or make a face pack out of it\n\nHow to make the pack?\n\nMix honey and finely ground cinnamon in equal proportions, apply on face and let it sit for 15 minutes before washing off with warm water and a mild exfoliating face wash.\n\n<strong>2. Fuller’s Earth (Multani Mitti)<\/strong>\n\nFuller’s earth is amazing if you suffer from pimples and acne, it helps unclog the clogged pores and reduces oil secretion. It also helps to absorb excess oil from the skin and removes appearance of scars and wounds. A face pack made out of Multani mitti Will do you a world of good.\n\nHow to make the pack?\n\nMix 3 portions of Multani mitti with one portion of Rose water and Vitamin e (evion).\n\nPut the mask on for 20 minutes before removing it with warm water.\n\n<strong>3. Tea tree &#8211; Aloe Vera face pack<\/strong>\n\nAloe Vera removes excess oil from the skin, it also has glycoproteins that heal and reduce the redness and inflammation.it is also an antioxidant that improves your blood circulation and purifies it. Aloe gel helps in various other skin problems too.\n\nTea tree oil has germicidal action and is excellent for skin in general.\n\nWhich is why, it makes sense to make a pack out of the two ingredients.\n\nHow to make the pack?\n\nMix three parts of aloe vera gel with one part of tea tree oil and make a paste, refrigerate before use for best results.\n\n<strong>6. Honey<\/strong>\n\nHoney is a secret natural cosmetic product. It can either be applied as a mask or used as a dietary supplement. It is a natural antibiotic substance as well as it has osmotic effects that absorb water from the wounds and releases hydrogen peroxide that acts as a very good antibacterial substance.\n\n<strong>7. Baking Soda<\/strong>\n\nAfter the removal of acne, it often occurs that a scar or spot is left behind which goes off with time. The problem is that it takes a lot of time. Baking soda speeds up the process.\n\n<strong>8. Cucumber<\/strong>\n\nCucumber is a rich source of minerals and vitamins. Fresh cucumber is also very cool and has a soothing effect on the skin. You can grind it and use it as a face mask or you can drink the water that you have soaked it in to deliver the nutrients to your body.\n\n<strong>9. Papaya<\/strong>\n\nPapaya is a natural source of vitamin A, which is a powerful antioxidant. The fruit also has anti-inflammatory properties.\n\n<strong>10. Lemon<\/strong>\n\nLemons are a rich source of Vitamin C. and there are two ways that you can go about it.\n\na. Dip a cotton swab in lemon juice and put it on the affected area right before you go to sleep.\nb. Mix it with cinnamon powder and apply, leave to dry.\n\nTry these home remedies, but if the problem persists make sure you reach out and get the right solution, <a href=\"https:\/\/garekarsmdskinclinic.com\/contact-us\/\" class=\"broken_link\">visit us<\/a>.","protected":false},"excerpt":{"rendered":"<p>Acne is a very common skin problem (especially amongst the youth) and while medical intervention may sometimes be called for, natural measures have their own place. Natural measures are way more convenient than the medical ones, but medical ones may be called for in extreme and recalcitrant (read &#8211; recurrent) cases. Acne occurs when dirt, [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/380"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=380"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/380\/revisions"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=380"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=380"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=380"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}