{"id":686,"date":"2016-07-25T14:16:03","date_gmt":"2016-07-25T14:16:03","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=686"},"modified":"2016-07-25T14:16:03","modified_gmt":"2016-07-25T14:16:03","slug":"get-mole-examined","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/get-mole-examined\/","title":{"rendered":"Why you should get that mole examined?"},"content":{"rendered":"Hi, we are the Garekars and we are a <a href=\"https:\/\/garekarsmdskinclinic.com\/\" target=\"_blank\" rel=\"noopener\">dermatology and aesthetics clinic in DLF Phase 1, Gurgaon<\/a>. Apart from constantly striving to be really good at what we do, we also like to write about general health and skincare for the benefit of people who follow this blog.\n<h2>Which is why today, we would like to tell you something about moles.<\/h2>\nNow, a mole is also called a birthmark or a beauty mark. But the medical name for the lesion is Nevus (pleural-nevi).\n\nThe occurrence rate of the lesion is so high that everybody, yes everybody will have at least one of these somewhere on their body.\n<h2>How are these formed?<\/h2>\nYour body has cells that are responsible for your skin colour. These cells are called melanocytes, when melanocytes gather together and form a dense cluster, the darker than normal area so formed is referred to as a “melanocytic nevus”.\n<h2>Are there types of the thing?<\/h2>\nSure there are. Melanocytic nevi are the most common type there is followed by Epidermal Nevi, Connective tissue nevi and Vascular Nevi (Strawberry birthmark).\n<h2>Why should these lesions concern me?<\/h2>\nNevi are usually of very little concern, you should only be concerned when they grow beyond the 6 mm mark, beyond which they could be classified as melanomas. And melanomas have a malignant transformation potential, which is to say that some malignant melanomas (skin cancers) will arise from pre-existing nevi. In fact, about 25% of malignant melanomas occur from pre-existing nevi.\n\nMalignancy is a condition where cancerous cells from one site can reach other sites and form satellite colonies that can complicate the case for the worst possible prognosis.\n\nWhen you talk about cancer, the best possible way to deal with it is to be constantly vigilant and on the lookout for the signs of the disease.\n<h2>How are these diagnosed?<\/h2>\nYour dermatologist is probably going to use something known as an ABCDE guideline to diagnose your lesion.\n\n<strong>A<\/strong>symmetrical skin lesion.\n<strong>B<\/strong>order of the lesion is irregular.\n<strong>C<\/strong>olor: melanomas usually have multiple colors.\n<strong>D<\/strong>iameter: moles greater than 6 mm are more likely to be melanomas than smaller moles.\n<strong>E<\/strong>nlarging: Enlarging or evolving\n<h2>What can your dermatologist do for you once you are identified as a high risk individual?<\/h2>\nYour dermatologist can remove the mole prophylactically (preventively) and save you a lot of trouble in the long run.\n\nLater, the tissue removed can be sent for microscopic evaluation and a final diagnosis can be made for the lesion.\n\nWe at Garekars M.D. have the professional expertise that you need. <a href=\"https:\/\/garekarsmdskinclinic.com\/contact-us\/\" target=\"_blank\" rel=\"noopener\" class=\"broken_link\">Contact us<\/a> regarding any feedbacks\/ further queries.","protected":false},"excerpt":{"rendered":"<p>Hi, we are the Garekars and we are a dermatology and aesthetics clinic in DLF Phase 1, Gurgaon. Apart from constantly striving to be really good at what we do, we also like to write about general health and skincare for the benefit of people who follow this blog. Which is why today, we would like to [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":690,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/686"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=686"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/686\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/690"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=686"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=686"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=686"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}