{"id":717,"date":"2016-08-03T07:11:44","date_gmt":"2016-08-03T07:11:44","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=717"},"modified":"2016-08-03T07:11:44","modified_gmt":"2016-08-03T07:11:44","slug":"how-to-deal-with-dark-circles","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/how-to-deal-with-dark-circles\/","title":{"rendered":"How to deal with dark circles?"},"content":{"rendered":"Having dark circles is a distressing experience. Medically this condition is called Periorbital hyperpigmentation and an astounding 53% of all Indian populace will suffer from the condition. Which is to say that you will find dark circles (of variable severity) on every other person that you come across.\n<h2>There are two ways that you can try to prevent dark circles.<\/h2>\n<h3>A. Lifestyle Modifications<\/h3>\nLifestyle modifications will treat dark circles that are caused primarily by an unruly and unhealthy lifestyle. A lifestyle that involves habits, sleep deprivation, and sun damage can damage the skin and are also known to cause skin damage around the eyes. Here’s what you can do,\n\n<strong>1. Control your sun exposure<\/strong>\n\nYou need to control your sun exposure, as increased exposure to the harmful rays of the sun can boost melanin pigmentation around the sensitive areas around the eyes, thus leading to dark circles. We recommend that you wear a quality sunscreen and use barriers (sunglasses) to prevent this damage.\n\n<strong>2. Get ample sleep<\/strong>\n\nNot getting enough sleep or leading a stressed out life is another major cause for dark circles. Make sure that you get at least 8 hours every day to stay away from dark circles.\n\n<strong>3. Control any habits that you might have<\/strong>\n\nSmoking, binge drinking, and other habits have been known to be an underlying cause for the dark circles. Stop smoking and drink only in moderation and see if your problem goes away on its own.\n\n<strong>4. Eat right<\/strong>\n\nNot eating right, or sparing your body of the nutrition that it so thoroughly deserves is another way to make sure that you make your skin quality suffer. Vitamins such as Vitamin C and Vitamin E are responsible upkeep and regulation of healthy skin.\n<h3>B. Topical therapy<\/h3>\nIf you want to try something that temporarily alleviates the problem and is soothing at the same time, you might want to\n\n<strong>1. Try tea bags<\/strong>\n\nTea bags have been known to reduce the appearance of dark spots and dark circles, for the best results, dip tea bags in ice cold water and then put them at the site.\n\n<strong>2. Also cold compresses<\/strong>\n\nYou can use a cotton ball dipped in cold water or the back side of a cold spoon to compress the area.\n\n<strong>3. Cucumber or potatoes?<\/strong>\n\nThey both work equally well, just grind some up and freeze them, the mush that you get after should be applied to the dark circles.\n\n<strong>4. Get professional help<\/strong>\n\nThe best way to get rid of dark circles permanently is to spot the underlying cause, and in order to do that, you need to seek professional help.\n\nFind your way to <a href=\"https:\/\/garekarsmdskinclinic.com\/\">Garekars M.D Skin Clinic<\/a>, one of the best dermatology clinics in Gurgaon and get the right solutions today.","protected":false},"excerpt":{"rendered":"<p>Having dark circles is a distressing experience. Medically this condition is called Periorbital hyperpigmentation and an astounding 53% of all Indian populace will suffer from the condition. Which is to say that you will find dark circles (of variable severity) on every other person that you come across. There are two ways that you can [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":718,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/717"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=717"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/717\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/718"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=717"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=717"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=717"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}