{"id":751,"date":"2016-08-23T16:51:33","date_gmt":"2016-08-23T16:51:33","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=751"},"modified":"2016-08-23T16:51:33","modified_gmt":"2016-08-23T16:51:33","slug":"hair-care-during-monsoons","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/hair-care-during-monsoons\/","title":{"rendered":"Hair Care During Monsoons"},"content":{"rendered":"Monsoons are an amazing time. The weather starts to get cooler. There is perennial shade all around. And there is no other season really where you would enjoy your tea and pakoras as much as the monsoons.\n\nSadly, the season also brings its fair share of problems.\n\nWe are the Garekars and we want to tell you about the perfect hair care tips for this monsoon.\n\n<strong>1. Wash right<\/strong>\n\nYou have to wash your scalp properly and frequently because of the high humidity levels. We actually sweat more during the monsoon season, and the sweat is the reason for most of our scalp problems.\n\nShampooing the right way will help remove all the debris and the dirt build up that has been accumulating in your hair. Washing right becomes more important when you consider the fact that you will get a clean head that stays that way.\n\n<strong>2. Use a conditioner<\/strong>\n\nConditioning helps your hair get the right nutrition to fight the frizziness. Make sure that you get the conditioner evenly spread (not just the scalp) as well; this will help you get the right effect spread evenly over all your strands.\n\nAlso, make sure that you are using the right kind. All hair types have different needs and using the wrong kind can wreak havoc on your hair.\n\n<strong>3. Avoid the dryer<\/strong>\n\nDrying hair with a hair dryer will leave your hair frizzy and unmanaged. And you definitely don’t need more of that this season. Also, steer clear of all sorts of straighteners and hair irons; they will definitely harm your hair.\n\n<strong>4. Throw the fine toothed comb away<\/strong>\n\nA fine toothed comb is one sure shot way that you will end up pulling out more hair strands than you can count. Keep all of these away for the entire monsoon season and keep all the wide toothed ones and the brushes for use.\n\n<strong>5. Protect your hair<\/strong>\n\nThe best way that you can make sure that your hair stays clean, dry, frizz free and soft this monsoon season is to cover them up.\n\nWhen you cover your hair, you protect them from all sorts of contaminants and the weather. The best way to do this is to put a physical barrier on your hair.\n\n<strong>6. Keep a short hair cut<\/strong>\n\nAnother way to make sure that your hair evades the brunt of the oh-so-cruel weather is to keep your hair shorter and closer to your head.\n\n<strong>7. Have lots of water<\/strong>\n\nHaving a lot of water makes your hair strong and healthy from the inside. And this is exactly what you need when you want the best hair that is healthy from within.\n\nWe are Garekars <a href=\"https:\/\/garekarsmdskinclinic.com\/\">M.D Dermatology Clinic<\/a> and we are one of the best dermatology clinics in Gurgaon.\n\nWatch this space for more interesting reads like this.","protected":false},"excerpt":{"rendered":"<p>Monsoons are an amazing time. The weather starts to get cooler. There is perennial shade all around. And there is no other season really where you would enjoy your tea and pakoras as much as the monsoons. Sadly, the season also brings its fair share of problems. We are the Garekars and we want to [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":754,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[6],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/751"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=751"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/751\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/754"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=751"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=751"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=751"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}