{"id":756,"date":"2016-08-23T17:10:44","date_gmt":"2016-08-23T17:10:44","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=756"},"modified":"2016-08-23T17:10:44","modified_gmt":"2016-08-23T17:10:44","slug":"chemical-peels-one-solution-for-all-your-skin-needs","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/chemical-peels-one-solution-for-all-your-skin-needs\/","title":{"rendered":"Chemical Peels: One Solution for All Your Skin Needs"},"content":{"rendered":"We are the Garekars and we have one of the best dermatology clinic in Guragon. We cater to all your skin problems and skin maintenance needs. We also like to inform and educate our readers about the best treatment modalities that exist right now via this blog section.\n\nAnd today, we will talk to you about Chemical peels.\n\nChemical peels are a great way to deal with almost all your skin problems. They are known to treat ageing skin, acne scars, skin discolorations, scars, sun damaged skin, wrinkled skin and even sagging skin.\n\nThe idea is that a chemical solution (containing mild acid mostly) is applied to the skin and allowed to stay for a while.\n\nThis acid will react with the skin and accelerate the process of exfoliation. Once the process of exfoliation happens, the skin will peel off on its own giving way to new, smooth, wrinkle free and scar free skin. This peeling is a controlled process and can be programmed to be either visible or just at a microscopic level.\n\nThere are three basic kinds of peels.\n\n<strong>1. Superficial peel<\/strong>\n\nAlpha hydroxyl acid is used to achieve this peel, the acid will only penetrate the superficial layers of skin.\n\nThe peel is used to treat mild skin discolorations and skin roughness.\n\nThis can be performed on the face, neck, hands and or chest.\n\nRequire up to 7 days to heal.\n\n<strong>2. Medium peel<\/strong>\n\nGlycolic or Trichloroacetic acid is used; this peel will penetrate the superficial and the middle layer of the skin.\n\nUsed to treat; age spots, fine lines, wrinkles, freckles and moderate skin discolorations. The peel is also used to treat certain precancerous skin growths such as actinic keratosis.\n\nThis peel too can be used on the face, neck, hands and or chest.\n\nRequire 7-14 days to heal.\n\n<strong>3. Deep peel<\/strong>\n\nTricholoracetic acid or Phenol is used to achieve this peel. The peel penetrates the middle layer deeply and removes the damaged skin cells.\n\nUsed in the treatment of; moderate lines, age spots, freckles, and shallow scars.\n\nOf the three peels, this is the one that shows the most dramatic change in the skin.\n\nThe peel can only be used on the face.\n\nRequire 14-21 days to heal.\n\nWhat to expect after a peel?\n\nAfter the peel is done and you have taken all the necessary precautions and made the right lifestyle modifications (as prescribed by your dermatologist) you will notice that a fresh new layer of skin that is healthy and radiant.\n\nChemical peels are really the fastest way to get results that are reliable, effective and have to be seen to be believed.\n\nIf you need radical results faster, consider getting a chemical peel done.\n\n<strong>The precautions<\/strong>\n\nImmediately following a peel, you must control your sun exposure and discontinue habits like smoking.\n\nUse only products that have been either prescribed or approved by your dermatologist.\n\nNever get a chemical peel if you are pregnant, think you might be, have psoriasis, eczema, rosacea or dermatitis.\n\n*Chemical peeling is a procedure that should be carried out by trained medical professionals prior to consultation.\n\nGet the right one for yourself, only at <a href=\"https:\/\/garekarsmdskinclinic.com\/\">Garekars M.D Skin Clinic<\/a>.","protected":false},"excerpt":{"rendered":"<p>We are the Garekars and we have one of the best dermatology clinic in Guragon. We cater to all your skin problems and skin maintenance needs. We also like to inform and educate our readers about the best treatment modalities that exist right now via this blog section. And today, we will talk to you [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":757,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/756"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=756"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/756\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/757"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=756"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=756"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=756"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}