{"id":776,"date":"2016-09-08T06:47:03","date_gmt":"2016-09-08T06:47:03","guid":{"rendered":"https:\/\/garekarsmdskinclinic.com\/?p=776"},"modified":"2016-09-08T06:47:03","modified_gmt":"2016-09-08T06:47:03","slug":"how-to-enjoy-monsoons-without-worrying-about-your-skin","status":"publish","type":"post","link":"https:\/\/garekarsmdskinclinic.com\/how-to-enjoy-monsoons-without-worrying-about-your-skin\/","title":{"rendered":"How to enjoy monsoons without worrying about your skin?"},"content":{"rendered":"When you think about monsoons, what do you think?\n\nDo you think about long romantic drives, hot piping food that comforts your soul, getting drenched in the rain or all that you think about is how monsoons are totally going to ruin your skin?\n\nMonsoons should be time for fun and frolic and not for worrying about your skin.\n\nMonsoons come with their own fair share of skin problems and conditions, and it is up to you to keep your skin safe this monsoon season.\n\nSome common skin conditions that can affect you this season are\n\n<strong>1. Skin infections<\/strong>\n\nSkin infections are the most common skin problem that you can face during the season. The reason for this is that humidity levels are through the roof in monsoons and common contaminants and infectious agents like bacteria and fungi love the season (they thrive the most in the season).\n\nThe best way to avoid this situation is to take frequent baths.\n\nIt is also a great idea to get a strong antibacterial\/ fungal soap\/ shower gel for the season.\n\n<strong>2. Excessive sweating<\/strong>\n\nMonsoons in India are a hot, humid affair.\n\nAnd one major concern it hot humid weather is perspiration.\n\nYou can get serious infections when you are constantly sweating through the day.\n\nThe best way to prevent the condition is to keep an antifungal powder handy. Your feet generally get affected the most due to humid socks. It is a good idea to use the anti-fungal powder prior to wearing socks.\n\n<strong>3. Hyper pigmented skin patches<\/strong>\n\nMixed exposure to the sun when combined with extreme humidity can lead to hyper pigmented, patchy skin.\n\nThe best way that you can avoid this situation is to get a quality (non sticky) sunscreen that has an SPF index of 30 or higher.\n\nOr you can go for professional de-pigmentation treatments at your dermatology clinic.*\n\n<strong>4. Allergic reaction<\/strong>\n\nThis is most common in Delhi, NCR. Why? Because the air here contains a wider spectrum of contaminants and pollutants than anywhere else.\n\nThese contaminants and pollutants when mix up with rain water give rise to skin allergies and allergic reactions.\n\nThe best way to prevent this situation is to simply avoid the first few monsoon showers.\n\nKeep a watchful eye for any red itchy patches. Timely intervention by a dermatologist could prevent a huge flare.\n\n<strong>5. Frizzy hair<\/strong>\n\nAnd at last. The thing that bothers women the most during the hot and humid monsoons is the unavoidable havoc the rains play on their hair.\n\nYou see, women who have even slightly curly hair will have experienced that their hair will turn frizzy as humidity amps up.\n\nAvoid this situation by keeping your head covered, conditioned and dry as often as you can.\n\nAnd don&#8217;t forget that hair serum, it helps a lot when you want to manage frizzy hair.\n\nFor more easy tips like these, keep following this blog at <a href=\"https:\/\/garekarsmdskinclinic.com\/\">www.garekarsmdskinclinic.com<\/a>(Garekars M.D. Dermatology &amp; Aesthetics Clinic, Gurgaon)\n<ul>\n \t<li>Consult your dermatologist.<\/li>\n<\/ul>","protected":false},"excerpt":{"rendered":"<p>When you think about monsoons, what do you think? Do you think about long romantic drives, hot piping food that comforts your soul, getting drenched in the rain or all that you think about is how monsoons are totally going to ruin your skin? Monsoons should be time for fun and frolic and not for [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":779,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[5],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/776"}],"collection":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/comments?post=776"}],"version-history":[{"count":0,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/posts\/776\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media\/779"}],"wp:attachment":[{"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/media?parent=776"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/categories?post=776"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/garekarsmdskinclinic.com\/wp-json\/wp\/v2\/tags?post=776"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}